// Напишите функцию, которая разбивает массив на группы заданного размера.
// function chunkArray(array, size) {
// // Ваш код здесь
// }
// Пример:
// chunkArray([1, 2, 3, 4, 5, 6, 7, 8], 2); // [[1, 2], [3, 4], [5, 6],
// [7, 8]]
// chunkArray([1, 2, 3, 4, 5, 6, 7, 8], 3); // [[1, 2, 3], [4, 5, 6],
// [7, 8]]

function chunkArray(array, size) {
    const result = [];
    for (let i = 0; i < array.length; i += size) { 
        // Срез массива от i-го индекса до i+size-го индекса и добавляем его в result.
        result.push(array.slice(i, i + size)); 
        // Если i+size-й индекс массива выходит за длину массива,
        // останавливаем цикл, чтобы не выходить за границы массива.
    }
    return result;
}

console.log(chunkArray([1, 2, 3, 4, 5, 6, 7, 8], 2)); // [[1, 2], [3, 4], [5, 6], [7, 8]]

console.log(chunkArray([1, 2, 3, 4, 5, 6, 7, 8], 3)); // [[1, 2, 3], [4, 5, 6], [7, 8]]